.config/emacs/dotslash-modules/packages.el
  (corfu-candidate-overlay-mode 1) ;; This is global
  (set-face-attribute 'corfu-candidate-overlay-face nil :foreground "dim grey")
  ;; Use TAB to accept a completion, how cool is that!
  (defun ./insert-state-tab ()
    "Handle TAB key in insert state.
  
  If corfu-candidate-overlay's overlay is active, calls
  `corfu-candidate-overlay--get-overlay-property', otherwise
  `evil-toggle-fold'. See my packages.org for this section for why I
  didn't use `org-cycle' here."
    (interactive)
    (if (overlayp corfu-candidate-overlay--overlay)
        (progn
          ;; This check is taken exactly from the implementation of
          ;; `corfu-candidate-overlay-complete-at-point's (as of
          ;; writing).
          (corfu-candidate-overlay--show)
          (if (and (overlayp corfu-candidate-overlay--overlay)
                   (not (string= (corfu-candidate-overlay--get-overlay-property 'after-string) "")))
              (corfu-candidate-overlay-complete-at-point)
            (if (string-match-p
                 "^\*+ "
                 (buffer-substring-no-properties
                  (line-beginning-position)
                  (line-end-position)))
            (evil-toggle-fold)
            (indent)
                )
            ))
            (if (string-match-p
                 "^\*+ "
                 (buffer-substring-no-properties
                  (line-beginning-position)
                  (line-end-position)))
            (evil-toggle-fold)
            (indent-for-tab-command)
      )))
  :bind ("TAB" . './insert-state-tab)
)

(use-package which-key
  :diminish
  :config
  (which-key-setup-side-window-bottom)
  (which-key-mode 1))

(use-package org
  :elpaca nil
  :config
  (setq org-startup-indented t)
  (setq org-edit-src-content-indentation 0)
  (setq org-list-indent-offset 2)

  (custom-theme-set-faces
   'user
   '(org-block ((t (:inherit fixed-pitch))))
   '(org-code ((t (:inherit (shadow fixed-pitch)))))
   '(org-document-info ((t (:foreground "dark orange"))))
   '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
   '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
   '(org-link ((t (:foreground "deep sky blue" :underline t))))
   '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
   '(org-property-value ((t (:inherit fixed-pitch))) t)
   '(org-block-begin-line ((t (:inherit (font-lock-comment-face fixed-pitch)))) t)
   '(org-block-end-line ((t (:inherit (font-lock-comment-face fixed-pitch)))) t)
   '(org-drawer ((t (:inherit fixed-pitch))) t)
   '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
   '(org-table ((t (:inherit fixed-pitch))))
   '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
   '(org-verbatim ((t (:inherit (shadow fixed-pitch)))))
   )

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (lua . t)
     (js . t)))

  (defun org-babel-execute:nim (body params)
    "Execute a block of Nim code with org-babel."
    (let ((in-file (org-babel-temp-file "n" ".nim"))
          (verbosity (or (cdr (assq :verbosity params)) 0)))
      (with-temp-file in-file
        (insert body))
      (org-babel-eval
       (format "nim compile --verbosity=%d --run %s" verbosity
               (org-babel-process-file-name in-file))
       "")))

  (defun org-babel-execute:moonscript (body params)
    "Execute a block of MoonScript code with org-babel."
    (let ((in-file (org-babel-temp-file "m" ".moon")))
      (with-temp-file in-file
        (insert body))
      (org-babel-eval
       (format "moon %s" (org-babel-process-file-name in-file)) "")))

  :hook
  (org-mode . (lambda () (visual-line-mode 1)
                (variable-pitch-mode)
                (display-line-numbers-mode -1)))
  )

(use-package org-superstar
  :config
  (setq org-superstar-configure-like-org-bullets t)
  :hook
  (org-mode . (lambda () (org-superstar-mode 1))))

(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-babel-safelist '("~/.config/emacs/packages.org"
                                         "~/.config/emacs/init.org")))

(use-package lua-mode)
(use-package moonscript)
(use-package nim-mode)
